[Chorus]
నీ మాట పలుకులే - ఏ నోట విన్న
నీ మాటలే నా ధ్యానము
నీ నితి వక్యమే- మా ప్రేమ గీతము
నీ రూపమే మాలో నిలిచెను

[Pre-Chorus]
ప్రతి మెకాలు నీ యెదుట వంగనూ
ప్రతి నాలుక నిన్ను స్తుతియించును
మా స్తుతులకు పాత్రుడా మా అధనయుడా (2x)

[Verse 1]
రాజల కంటేను రారాజుల కంటేను
గొప్ప వాడువు నీవు యేసయ్య
కెంపుల కంటేను రతనాల కంటేను
సుగుణాలలో సంపన్నుడా.... (2x)

[Bridge 1]
నీ మాట సెలవియ్యగా 
సముద్రము నిమ్మళమాయెనూ
నీ మాట సెలవియ్య గా
పేతురు నీళ్ళ మీద నడువసాగెను

[Pre-Chorus]
మా స్తుతులకు పాత్రుడా మా అధనయుడా (2x)

[Verse 2]
ఎప్పుడు ఎకడైనా పుట్టు గ్రుడ్డివాన్ని కన్నులు తెరచిన వారు ఎవరు లేరయ్యా
ఆకాశము నుండి భూమికి దిగివచ్చి
గ్రుడ్డివాని కన్నులు తెరచిన యేసయ్యి (2x)

[Bridge 2]
నీ మాట సెలవియ్యగా
రోగులంత బాగుపడెనూ
నీ మాట సెలవియ్య గా
కానాను స్త్రీ బాగు పడెను

[Pre-Chorus]
మా స్తుతులకు పాత్రుడా మా అధనయుడా (2x)

[Outro]
నీ మాట పలుకులే - ఏ నోట విన్న
నీ మాటలే నా ధ్యానము
నీ నితి వక్యమే- మా ప్రేమ గీతము
నీ రూపమే మాలో నిలిచెను